package com.example.wyymusic;

import cn.hutool.core.collection.CollUtil;
import cn.hutool.core.util.RandomUtil;
import cn.hutool.core.util.StrUtil;
import com.example.wyymusic.model.domain.MusicList;
import com.example.wyymusic.service.MusicListService;
import com.example.wyymusic.service.MusicService;
import com.example.wyymusic.utils.FileUpload;
import com.example.wyymusic.utils.RegexUtil;
import com.google.gson.Gson;
import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.data.redis.core.StringRedisTemplate;
import org.springframework.data.redis.core.ZSetOperations;
import org.springframework.util.DigestUtils;

import javax.annotation.Resource;
import java.io.File;
import java.lang.reflect.Array;
import java.util.*;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

import static com.example.wyymusic.constant.CommonConstant.*;

@SpringBootTest
class WyymusicApplicationTests {

    @Resource
    private StringRedisTemplate stringRedisTemplate;

    @Resource
    private MusicService musicService;

    @Resource
    private FileUpload fileUpload;


    @Resource
    private MusicListService musicListService;
    @Test
    void contextLoads() {
        String s = "山河无恙在我胸、BlackCarAfar、只要平凡、Home、你的答案、DreamHeaven、最美的伤口、惊雷、被你宠爱、只有喜欢、GetAway、上弦之月、你的答案、喜欢你的喜欢、Candy、我们的中国心、NUMBER、天真世界的叛徒、LateNightTrain、君とこの空の下で、半壶纱、Mywoman、爱竹说、震撼电音-呕呕、学猫叫、我还是从前那个少年、Don'tLeaveMeAlone、爱竹说、桥边姑娘、想见你想见你想见你、可爱的人、爱拼才会赢、在心里从此永远有个你、套马杆、伤心的时候可以听情歌、火辣辣的情歌、相思的雨、我从草原来、红尘永相伴、缘分惹的祸、老婆最大、突然的自我、光辉岁月、我只在乎你、自由飞翔、兄弟抱一下、忽然好想念、今生爱上你、相思的苦、一个人的寂寞两个人的错、涛声依旧、单身情歌、卜卦、山里红、一万个对不起、菊花爆满山、九百九十九朵玫瑰、犯错、雨蝶、错过了缘分错过你、歌在飞、醉红颜、爱情买卖、一生有你、走过咖啡屋、沧桑情歌、谁是我的郎、酒干倘卖无、你不来我不老、杀阡陌、你的柔情我永远不懂、天籁传奇、老地方的雨、千千阙歌、哥哥妹妹、曾经的你、红豆、上海滩、日不落、同桌的你、独角戏、路灯下的小姑娘、红尘情歌、一剪梅、一个人的天荒地老、相见恨晚、西海情歌、红尘情歌、天若有情、万水千山总是情、梦醒时分、我的未来不是梦、讲不出再见、万水千山总是情、爱如潮水、风中有朵雨做的云、吻别、容易受伤的女人、十年、挪威的森林、我是不是该安静的走开、我可以抱你吗、幸运女神、雨一直下、海阔天空、又见炊烟、至少还有你、怎样遇见你、朋友别哭、小城故事、Love Story、千千阕歌、真的爱你、荒度余生、粉红色的回忆、铁血丹心、一路上有你、萤火虫长大了、从未这样心动过、我真的受伤了、征服、傻傻等、可惜不是你、太傻、我是否也在你心中、甜蜜蜜、美丽的神话、他一定很爱你、让一切随风、鸿雁(现场版)、爱是你我、多情伤离别、你偷走了我的心、没有你陪伴真的好孤单、得到你的人却得不到你的心、蓝莲花、无所谓、成都、终于等到你、错误的邂逅、想你啦、做我老婆好不好、心会跟爱一起走、过火、咱们结婚吧、爱就爱了、等你等了那么久、美了美了、小三、同桌的你、带你去旅行、唱着情歌流着泪、风中有朵雨做的云、红豆、水手、再见只是陌生人、遇到、西海情歌、我走后、Lutra、走火入魔、我愿意平凡的陪在你身旁、西海情歌、相思的债、我们不一样、给你、如果的事、吻别、一生有你、海阔天空、粉红色的回忆、夜曲、千千阙歌、七里香、我是佛前一朵莲、下山、等你下课、无所谓、稻香、驱鼠超声波、猫叫声驱鼠、又见炊烟、甜蜜蜜、朋友别哭、告白气球、一生与你擦肩而过、我一个人、红尘情歌、白狐、童话镇、你的答案、真的爱你、美丽的神话、千里之外、平凡之路、偏偏、Love Story、はいからさん、可惜不是你、十年、相见恨晚、心雨、听妈妈的话、超逼真雷雨天、容易受伤的女人、一千零一个愿望、我爱你胜过你爱我、发如雪、呼伦贝尔大草原、曾经的你、倩女幽魂、我的九寨、鸿雁(慢四版)、最熟悉的陌生人、故乡的云、爱如潮水、想见你想见你想见你、简单爱、红日、海草舞、给我一首歌的时间、Friendships、爱是你我、蓝石白其、冲动的惩罚、威風堂々、东风破、一路向北、大约在冬季、少年壮志不言愁、我的未来不是梦、鱼的眼泪在海心里、藕断丝连、雨一直下、珊瑚海、菊花台、套马杆、Дадада、我可以抱你吗、晚秋、走天涯、搁浅、那一天、你若三冬、火红的萨日朗、山不转水转、恋红尘、爱是你我、枫、小芳、山谷里的思念、美丽的草原我的家、水中花、至少还有你、一路上有你、算什么男人、酒醉的蝴蝶、爱恨情歌、酒醉的蝴蝶、在水一方、借口、句号、一个人挺好、从此以后、沧海一声笑、天边、卓玛、忘情水、蓝莲花、Trouble Is a Friend、短发、手心里的温柔、夜的第七章、以父之名、亲爱的你在哪里、林中鸟、我和草原有个约定、父亲的草原母亲的河、从头再来、千千阕歌、爱情里没有谁对谁错、彩虹、爱江山更爱美人、大悲咒、大城小爱、懂你、卜卦、一千个伤心的理由、蒲公英的约定、想你总是很甜蜜、情人、像极了、カーニバル、野狼disco、半壶纱、乌苏里船歌、杀阡陌、再见吧喵小姐、过火、阳光总在风雨后、黑色毛衣、寻、童话、安静、甜甜的、有多少爱可以重来、我是不是该安静的走开、黄土高坡、年的第一场雪、驼铃、去伊犁的路上、我的梦在草原、沧桑情歌、完美世界、咱们结婚吧、春天里、贝贝、蜗牛、在水一方、错过了缘分错过你、猫、当爱已成往事、风往北吹、断点、鸿雁、炸掉、东西、卓玛的歌、度、酒醉的蝴蝶、天边、远飞的大雁、处处吻、父亲的草原母亲的河、悬溺、年少有为、讲不出再见、Time、梦驼铃、比心更痛的眼眸、春泥、心引力、上海滩、说好的幸福呢、纸短情长、千纸鹤、念旧、传奇、红梅赞、霍元甲、人生路、永远的兄弟、余年、永远的战士、该死的温柔、征服、我和草原有个约定、没有人比你更爱我、念想、黄玫瑰、在他乡、伴郎、鲁冰花、生僻字、男儿当自强、耿、退后、兰亭序、花都开好了、懂得、青藏高原、美丽的草原我的家、十七岁的雨季、威廉古堡、武夷来思、一生何求、不能说的秘密、c哩c哩、霍元甲、知否知否、我的中国心、跟往事干杯、一千年以后、蓝莲花、长长久久、傲娇中国、大田後生仔欢乐、世界末日、草原之夜、老鼠最害怕的声音、歌在飞、那女孩对我说、绿光、成都、吉祥藏历年、心的祈祷、谢谢你、最心疼的女人、无人之岛、PLANET、辽阔的草原、倾国倾城、没有情人的情人节、曾经心疼、卡农钢琴曲、晚安、Зая、草原夜色美、秋天的童话、不分昼夜、糊涂的爱、burning、Attention、想你啦、驼铃、披着羊皮的狼、好人一生平安、手写的从前、窗外、精忠报国、灵灵、一曲相思、开不了口、分开比相遇更突然、这么久没见、谁的眼泪在飞、漫步人生路、冬季到台北来看雨、梦中的额吉、刚好遇见你、十送红军、Me Too、情之恋、一场游戏一场梦、Samsara、阿里山的姑娘、我是一只小小鸟、朋友难当、拉萨夜雨、我的楼兰、陪你一起看草原、弯弯的月亮、嚣张en、记事本、Seve、离别草原、双截棍、卓玛、起风了、彩云之南、一起走过的日子、谁明浪子心、草原之夜、来生缘、一晃就老了、我和草原有个约定、小薇、好可惜、Panama、我想有个家、最美的还是我们新疆、怀念战友、最爱的人伤我最深、倒带、那男孩还好吗、改不掉、透明、雨中飘荡的回忆、草原的月亮、小三、红昭愿、来生愿做一朵莲、心雨、女人是老虎、Shape of You、你潇洒我漂亮、不再犹豫、高手高手高高手、我的爱出了轨、寂寞的季节、你是我的玫瑰花、站在草原望北京、月亮惹的祸、牛仔很忙、风继续吹、我们、身披彩衣的姑娘、等、BABY、Take me to your heart、西窗烟雨、漂亮的姑娘就要嫁人啦、屋顶着火、一脸红霞、马上有钱、奢香夫人、火红的萨日朗、笑场、christmas in my heart、千年之恋、我就是这么可爱、北国之春、最高地位、与我无关、亲爱的我爱你、雨中飘荡的回忆、鸿雁飞飞、遇上你是我的缘、九妹、找一个不伤心的理由、南屏晚钟、鳌拜舞广场舞歌曲、七月七日晴、霸王别姬、沙漠骆驼、小城故事、画、心墙、恰似你的温柔、两只蝴蝶、马头琴的诉说、敖包相会、Just One Last Dance、恋恋风尘、冈拉梅朵、你若安好我不打扰、爱的供养、怎么了、舞女泪、Yesterday、敖包相会、怀念战友、映山红、你究竟有几个好妹妹、喀什葛尔胡杨、清明上河图、被情伤过的女人、荒度余生、愿做菩萨那朵莲、相思渡口、上帝也哭泣、爱走了心碎了、美酒加咖啡、我和草原有个约会、远远的看着你、雾里看花、少年，少年、梦中的妈妈、雨花石、第一次告白、放下所有放不下你、王杰我愿意、好想爱这个世界啊、美人吟、幸福的两口子、无情的雨无情的你、只要有你、难忘的初恋情人、我不想说、雁南飞、我又想你了、这条街、飞的更高、千古绝唱、谢谢你的爱、一剪梅、一场游戏一场梦、微信提示音大全试听、新贵妃醉酒、自由自在、鱼和水的记忆、往事只能回味、凶猫叫声驱鼠、猫的叫声音、英雄、我以茶之名、动了情伤了心、特别的爱给特别的你、我的祖国、想着你亲爱的、英雄、爱你十分泪七分、荒漠骆驼、羞答答的玫瑰静悄悄地开、梦草原、浪子的心情、黄昏、夜空中最亮的星、我愿意王杰、算什么广场舞、今后我与自己流浪、别用你的残忍折磨我、不仅仅是喜欢、火红的萨日朗伴奏、相思风雨中、水云间、等你等了那么久、小苹果、我的快乐就是想你";
        String[] split = s.split("、");
        for (String s1 : split) {
            musicService.musicUpload(s1,"暂时没有歌词*","202304119_104932470.mp3","202305123_212420632.jpg");
        }
    }

    @Test
    void musicListService(){
        String s = "山河无恙在我胸、BlackCarAfar、只要平凡、Home、你的答案、DreamHeaven、最美的伤口、惊雷、被你宠爱、只有喜欢、GetAway、上弦之月、你的答案、喜欢你的喜欢、Candy、我们的中国心、NUMBER、天真世界的叛徒、LateNightTrain、君とこの空の下で、半壶纱、Mywoman、爱竹说、震撼电音-呕呕、学猫叫、我还是从前那个少年、Don'tLeaveMeAlone、爱竹说、桥边姑娘、想见你想见你想见你、可爱的人、爱拼才会赢、在心里从此永远有个你、套马杆、伤心的时候可以听情歌、火辣辣的情歌、相思的雨、我从草原来、红尘永相伴、缘分惹的祸、老婆最大、突然的自我、光辉岁月、我只在乎你、自由飞翔、兄弟抱一下、忽然好想念、今生爱上你、相思的苦、一个人的寂寞两个人的错、涛声依旧、单身情歌、卜卦、山里红、一万个对不起、菊花爆满山、九百九十九朵玫瑰、犯错、雨蝶、错过了缘分错过你、歌在飞、醉红颜、爱情买卖、一生有你、走过咖啡屋、沧桑情歌、谁是我的郎、酒干倘卖无、你不来我不老、杀阡陌、你的柔情我永远不懂、天籁传奇、老地方的雨、千千阙歌、哥哥妹妹、曾经的你、红豆、上海滩、日不落、同桌的你、独角戏、路灯下的小姑娘、红尘情歌、一剪梅、一个人的天荒地老、相见恨晚、西海情歌、红尘情歌、天若有情、万水千山总是情、梦醒时分、我的未来不是梦、讲不出再见、万水千山总是情、爱如潮水、风中有朵雨做的云、吻别、容易受伤的女人、十年、挪威的森林、我是不是该安静的走开、我可以抱你吗、幸运女神、雨一直下、海阔天空、又见炊烟、至少还有你、怎样遇见你、朋友别哭、小城故事、Love Story、千千阕歌、真的爱你、荒度余生、粉红色的回忆、铁血丹心、一路上有你、萤火虫长大了、从未这样心动过、我真的受伤了、征服、傻傻等、可惜不是你、太傻、我是否也在你心中、甜蜜蜜、美丽的神话、他一定很爱你、让一切随风、鸿雁(现场版)、爱是你我、多情伤离别、你偷走了我的心、没有你陪伴真的好孤单、得到你的人却得不到你的心、蓝莲花、无所谓、成都、终于等到你、错误的邂逅、想你啦、做我老婆好不好、心会跟爱一起走、过火、咱们结婚吧、爱就爱了、等你等了那么久、美了美了、小三、同桌的你、带你去旅行、唱着情歌流着泪、风中有朵雨做的云、红豆、水手、再见只是陌生人、遇到、西海情歌、我走后、Lutra、走火入魔、我愿意平凡的陪在你身旁、西海情歌、相思的债、我们不一样、给你、如果的事、吻别、一生有你、海阔天空、粉红色的回忆、夜曲、千千阙歌、七里香、我是佛前一朵莲、下山、等你下课、无所谓、稻香、驱鼠超声波、猫叫声驱鼠、又见炊烟、甜蜜蜜、朋友别哭、告白气球、一生与你擦肩而过、我一个人、红尘情歌、白狐、童话镇、你的答案、真的爱你、美丽的神话、千里之外、平凡之路、偏偏、Love Story、はいからさん、可惜不是你、十年、相见恨晚、心雨、听妈妈的话、超逼真雷雨天、容易受伤的女人、一千零一个愿望、我爱你胜过你爱我、发如雪、呼伦贝尔大草原、曾经的你、倩女幽魂、我的九寨、鸿雁(慢四版)、最熟悉的陌生人、故乡的云、爱如潮水、想见你想见你想见你、简单爱、红日、海草舞、给我一首歌的时间、Friendships、爱是你我、蓝石白其、冲动的惩罚、威風堂々、东风破、一路向北、大约在冬季、少年壮志不言愁、我的未来不是梦、鱼的眼泪在海心里、藕断丝连、雨一直下、珊瑚海、菊花台、套马杆、Дадада、我可以抱你吗、晚秋、走天涯、搁浅、那一天、你若三冬、火红的萨日朗、山不转水转、恋红尘、爱是你我、枫、小芳、山谷里的思念、美丽的草原我的家、水中花、至少还有你、一路上有你、算什么男人、酒醉的蝴蝶、爱恨情歌、酒醉的蝴蝶、在水一方、借口、句号、一个人挺好、从此以后、沧海一声笑、天边、卓玛、忘情水、蓝莲花、Trouble Is a Friend、短发、手心里的温柔、夜的第七章、以父之名、亲爱的你在哪里、林中鸟、我和草原有个约定、父亲的草原母亲的河、从头再来、千千阕歌、爱情里没有谁对谁错、彩虹、爱江山更爱美人、大悲咒、大城小爱、懂你、卜卦、一千个伤心的理由、蒲公英的约定、想你总是很甜蜜、情人、像极了、カーニバル、野狼disco、半壶纱、乌苏里船歌、杀阡陌、再见吧喵小姐、过火、阳光总在风雨后、黑色毛衣、寻、童话、安静、甜甜的、有多少爱可以重来、我是不是该安静的走开、黄土高坡、年的第一场雪、驼铃、去伊犁的路上、我的梦在草原、沧桑情歌、完美世界、咱们结婚吧、春天里、贝贝、蜗牛、在水一方、错过了缘分错过你、猫、当爱已成往事、风往北吹、断点、鸿雁、炸掉、东西、卓玛的歌、度、酒醉的蝴蝶、天边、远飞的大雁、处处吻、父亲的草原母亲的河、悬溺、年少有为、讲不出再见、Time、梦驼铃、比心更痛的眼眸、春泥、心引力、上海滩、说好的幸福呢、纸短情长、千纸鹤、念旧、传奇、红梅赞、霍元甲、人生路、永远的兄弟、余年、永远的战士、该死的温柔、征服、我和草原有个约定、没有人比你更爱我、念想、黄玫瑰、在他乡、伴郎、鲁冰花、生僻字、男儿当自强、耿、退后、兰亭序、花都开好了、懂得、青藏高原、美丽的草原我的家、十七岁的雨季、威廉古堡、武夷来思、一生何求、不能说的秘密、c哩c哩、霍元甲、知否知否、我的中国心、跟往事干杯、一千年以后、蓝莲花、长长久久、傲娇中国、大田後生仔欢乐、世界末日、草原之夜、老鼠最害怕的声音、歌在飞、那女孩对我说、绿光、成都、吉祥藏历年、心的祈祷、谢谢你、最心疼的女人、无人之岛、PLANET、辽阔的草原、倾国倾城、没有情人的情人节、曾经心疼、卡农钢琴曲、晚安、Зая、草原夜色美、秋天的童话、不分昼夜、糊涂的爱、burning、Attention、想你啦、驼铃、披着羊皮的狼、好人一生平安、手写的从前、窗外、精忠报国、灵灵、一曲相思、开不了口、分开比相遇更突然、这么久没见、谁的眼泪在飞、漫步人生路、冬季到台北来看雨、梦中的额吉、刚好遇见你、十送红军、Me Too、情之恋、一场游戏一场梦、Samsara、阿里山的姑娘、我是一只小小鸟、朋友难当、拉萨夜雨、我的楼兰、陪你一起看草原、弯弯的月亮、嚣张en、记事本、Seve、离别草原、双截棍、卓玛、起风了、彩云之南、一起走过的日子、谁明浪子心、草原之夜、来生缘、一晃就老了、我和草原有个约定、小薇、好可惜、Panama、我想有个家、最美的还是我们新疆、怀念战友、最爱的人伤我最深、倒带、那男孩还好吗、改不掉、透明、雨中飘荡的回忆、草原的月亮、小三、红昭愿、来生愿做一朵莲、心雨、女人是老虎、Shape of You、你潇洒我漂亮、不再犹豫、高手高手高高手、我的爱出了轨、寂寞的季节、你是我的玫瑰花、站在草原望北京、月亮惹的祸、牛仔很忙、风继续吹、我们、身披彩衣的姑娘、等、BABY、Take me to your heart、西窗烟雨、漂亮的姑娘就要嫁人啦、屋顶着火、一脸红霞、马上有钱、奢香夫人、火红的萨日朗、笑场、christmas in my heart、千年之恋、我就是这么可爱、北国之春、最高地位、与我无关、亲爱的我爱你、雨中飘荡的回忆、鸿雁飞飞、遇上你是我的缘、九妹、找一个不伤心的理由、南屏晚钟、鳌拜舞广场舞歌曲、七月七日晴、霸王别姬、沙漠骆驼、小城故事、画、心墙、恰似你的温柔、两只蝴蝶、马头琴的诉说、敖包相会、Just One Last Dance、恋恋风尘、冈拉梅朵、你若安好我不打扰、爱的供养、怎么了、舞女泪、Yesterday、敖包相会、怀念战友、映山红、你究竟有几个好妹妹、喀什葛尔胡杨、清明上河图、被情伤过的女人、荒度余生、愿做菩萨那朵莲、相思渡口、上帝也哭泣、爱走了心碎了、美酒加咖啡、我和草原有个约会、远远的看着你、雾里看花、少年，少年、梦中的妈妈、雨花石、第一次告白、放下所有放不下你、王杰我愿意、好想爱这个世界啊、美人吟、幸福的两口子、无情的雨无情的你、只要有你、难忘的初恋情人、我不想说、雁南飞、我又想你了、这条街、飞的更高、千古绝唱、谢谢你的爱、一剪梅、一场游戏一场梦、微信提示音大全试听、新贵妃醉酒、自由自在、鱼和水的记忆、往事只能回味、凶猫叫声驱鼠、猫的叫声音、英雄、我以茶之名、动了情伤了心、特别的爱给特别的你、我的祖国、想着你亲爱的、英雄、爱你十分泪七分、荒漠骆驼、羞答答的玫瑰静悄悄地开、梦草原、浪子的心情、黄昏、夜空中最亮的星、我愿意王杰、算什么广场舞、今后我与自己流浪、别用你的残忍折磨我、不仅仅是喜欢、火红的萨日朗伴奏、相思风雨中、水云间、等你等了那么久、小苹果、我的快乐就是想你";
        String[] split = s.split("、");

        for (String s1 : split) {
            musicListService.createList("202305123_212420632.jpg",s1);
        }

        for (long i = 9; i < 600; i++) {
//            Set integers = RandomUtil.randomEleSet(CollUtil.newArrayList(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598), 50);
//            List list = new ArrayList<>(integers);
//            musicListService.addMusicBatch(i,list);
        }
    }


    @Test
    void num(){
        Map<Integer,List<Long>> map = new HashMap<>();

        map.put(1,new ArrayList<>());

        Gson gson = new Gson();
        String s = gson.toJson(map);

        Map map1 = gson.fromJson(s, Map.class);

        System.out.println(map1.get("1"));
    }





}
